import os
s = os.getcwd() #путь к директорий
a = os.listdir(s) #выводит все файлы и папки в директорий
print(a)
 
print("_____________________________________________________________________________________")


for entries in a: #пробегается по файлам и папкам в директорий
    print(entries)

print("_____________________________________________________________________________________")


items = os.scandir(s) #указатель на файл итератором
for item in items:
    print(item.name)

print("_____________________________________________________________________________________")


path_to_file = os.path.join(s, "1.txt") #выводит путь в файлу в директорий
print(path_to_file)

print("_____________________________________________________________________________________")

isFile = os.path.isfile(path_to_file) #булеан, который проверяет файл ли или нет
print(isFile)

print("_____________________________________________________________________________________")